In [5]:
import pandas as pd

# Sample DataFrame
data = {'state_id': [1, 1, 2, 2, 3],
        'school_id': [101, 102, 201, 202, 301],
        'subjects': ['english math chemistry', 'math chemistry', 'english', 'math english', 'chemistry']}
df = pd.DataFrame(data)

In [6]:
df

   state_id  school_id                subjects
0         1        101  english math chemistry
1         1        102          math chemistry
2         2        201                 english
3         2        202            math english
4         3        301               chemistry

In [4]:
# Split the subjects column into separate rows
df = df.assign(subject=df['subjects'].str.split()).explode('subject')
df

   state_id  school_id                subjects    subject
0         1        101  english math chemistry    english
0         1        101  english math chemistry       math
0         1        101  english math chemistry  chemistry
0         1        101  english math chemistry    english
0         1        101  english math chemistry       math
0         1        101  english math chemistry  chemistry
0         1        101  english math chemistry    english
0         1        101  english math chemistry       math
0         1        101  english math chemistry  chemistry
1         1        102          math chemistry       math
1         1        102          math chemistry  chemistry
1         1        102          math chemistry       math
1         1        102          math chemistry  chemistry
2         2        201                 english    english
3         2        202            math english       math
3         2        202            math english    english
3         2        202            math english       math
3         2        202            math english    english
4         3        301               chemistry  chemistry

In [ ]:
# Define a function to count the number of words in a string
word_count = lambda x: len(x.split())

In [ ]:
# Apply the function to the text_column and create a boolean mask
condition = df['text_column'].apply(word_count) > 1

In [ ]:
# Display the filtered DataFrame
print(filtered_df)